# for문
# 반복을 처리할 때 사용
#  for 변수 in 반복할 값:
    # 구문 안으로

# 아래와 같이 출력되는 프로그램을 작성하시오.
# '''
# 최대 별 수 : 4
# *
# **
# ***
# ****
# '''

# range() 범위를 생성 클래스
# 마지막 수: max -1
# range(8) -> range(0, 8)
# range(init, max, add)

# print(range(0, 8, 2))

# for i in [0, 1, 2, 3, 4, 5, 6, 7]:  #이 조건이 참인동안 반복
# for i in range(0,8,2):
#     print(i)

# ==============================================================
# num = int(input('최대 별 수 : '))

# for i in range(1, num+1):   # 0대신 1부터 시작, num+1개까지
#     print('*' * i)
# ==============================================================

# 구구단
# 2단부터 2x9 ~ 9x9
# 2x1=2, 2x2=4, 2x3=6
# 9x1=9, ... 9x9=81
# 요사 1 - 한줄에 각 단씩 나오도록 => 단 끝나면 한 줄 내리기 print()
# 요사 2 - x*y 값 줄 맞추기 => string format :2d
# 단 시작을 표시
for x in range(2, 9+1):
    # if x == 8: break  #7단 끝나면 구구단 끝
    if x == 8: continue #8단은 건너뛰고 9단

    print(f'{x}단 시작')
    for y in range(1, 9+1):
        #문자열 포맷팅 없으면 print(x, 'x', y, '=', x*y) 
        print(f'{x} x {y} = {x * y:2d}', end = '     ')

    print()     #그냥 한 줄 내리기

print('구구단 종료\n\n')

## 반복을 빠져나올 때: break
## 반복문에서 특정 조건을 지나칠 때: continue